ferrari-499p-v3/case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    #include "include/fixedInlet"

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    lowerWall
    {
        type            fixedValue;
        value           $internalField;
    }

    f499pGroup
    {
        type            noSlip;
    }

    // Rolling wheels. The contact patch must move with the ground (+x at 40 m/s),
    // so omega = -U / r about +y, with r = axle height above the ground.
    // Front: 40 / 0.3273 = 122.2 rad/s   Rear: 40 / 0.3365 = 118.9 rad/s
    // These exact patch names take priority over the f499pGroup entry above.
    f499p_wheel_FL
    {
        type            rotatingWallVelocity;
        origin          (0.9561 0 0.3273);
        axis            (0 1 0);
        omega           -122.2;
    }
    f499p_wheel_FR
    {
        type            rotatingWallVelocity;
        origin          (0.9561 0 0.3273);
        axis            (0 1 0);
        omega           -122.2;
    }
    f499p_wheel_RL
    {
        type            rotatingWallVelocity;
        origin          (4.0540 0 0.3365);
        axis            (0 1 0);
        omega           -118.9;
    }
    f499p_wheel_RR
    {
        type            rotatingWallVelocity;
        origin          (4.0540 0 0.3365);
        axis            (0 1 0);
        omega           -118.9;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
